#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.delete_lambda.data.archive_file.lambda: Reading...
module.create_short_url_lambda.data.archive_file.lambda: Reading...
module.redirect_lambda.data.archive_file.lambda: Reading...
module.create_short_url_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1]
module.delete_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1]
module.redirect_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1]
module.create_short_url_lambda.data.aws_iam_policy_document.assume_role: Reading...
module.delete_lambda.data.aws_iam_policy_document.assume_role: Reading...
module.redirect_lambda.data.aws_iam_policy_document.assume_role: Reading...
aws_api_gateway_rest_api.url_shortener_api: Refreshing state... [id=ktqo0w8q1j]
module.create_short_url_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.redirect_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.delete_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
aws_api_gateway_resource.redirect_resource: Refreshing state... [id=n44nx6]
module.post_url_method.aws_api_gateway_method.method: Refreshing state... [id=agm-ktqo0w8q1j-0eyhu620n6-POST]
module.delete_url_method.aws_api_gateway_method.method: Refreshing state... [id=agm-ktqo0w8q1j-0eyhu620n6-DELETE]
module.redirect_url_method.aws_api_gateway_method.method: Refreshing state... [id=agm-ktqo0w8q1j-n44nx6-GET]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.allow_delete_url_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_delete_url_lambda" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.allow_get_url_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_get_url_lambda" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dax:Query",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.create_short_url_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "create_short_url_lambda" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:PutItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_api_gateway_deployment.url_shortener_api_deployment will be created
  + resource "aws_api_gateway_deployment" "url_shortener_api_deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "ktqo0w8q1j"
      + triggers      = (known after apply)
    }

  # aws_api_gateway_stage.live will be created
  + resource "aws_api_gateway_stage" "live" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "ktqo0w8q1j"
      + stage_name    = "live"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # aws_api_gateway_usage_plan.usage will be created
  + resource "aws_api_gateway_usage_plan" "usage" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "slim-url-shortener-api-usage-plan"
      + tags_all = (known after apply)

      + api_stages {
          + api_id = "ktqo0w8q1j"
          + stage  = "live"
        }

      + throttle_settings {
          + burst_limit = 1000
          + rate_limit  = 10000
        }
    }

  # aws_dynamodb_table.urls will be created
  + resource "aws_dynamodb_table" "urls" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "ID"
      + id               = (known after apply)
      + name             = "urls"
      + range_key        = "Code"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 1

      + attribute {
          + name = "Code"
          + type = "S"
        }
      + attribute {
          + name = "ID"
          + type = "S"
        }
      + attribute {
          + name = "URL"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "Code"
          + name               = "CodeIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "URL"
          + read_capacity      = 1
          + write_capacity     = 1
        }
    }

  # module.create_short_url_lambda.data.aws_iam_policy_document.policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "policies" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + minified_json             = (known after apply)
      + override_policy_documents = [
          + (known after apply),
        ]

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
          + sid       = "LogToCloudwatch"
        }
    }

  # module.create_short_url_lambda.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "create-short-url-a57940d-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "DefaultPolicy"
          + policy = (known after apply)
        }
    }

  # module.create_short_url_lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "create-short-url-a57940d_lambda_function_payload.zip"
      + function_name                  = "create-short-url-a57940d"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BASE_URL" = "https://yr9q6b5bjc.execute-api.us-east-1.amazonaws.com/live/"
            }
        }
    }

  # module.delete_lambda.data.aws_iam_policy_document.policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "policies" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + minified_json             = (known after apply)
      + override_policy_documents = [
          + (known after apply),
        ]

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
          + sid       = "LogToCloudwatch"
        }
    }

  # module.delete_lambda.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "delete-url-a57940d-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "DefaultPolicy"
          + policy = (known after apply)
        }
    }

  # module.delete_lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "delete-url-a57940d_lambda_function_payload.zip"
      + function_name                  = "delete-url-a57940d"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)
    }

  # module.delete_url_method.aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "DELETE"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "0eyhu620n6"
      + rest_api_id             = "ktqo0w8q1j"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.delete_url_method.aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "delete-url-a57940d"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:692735942459:ktqo0w8q1j/*/DELETE/"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.post_url_method.aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "0eyhu620n6"
      + rest_api_id             = "ktqo0w8q1j"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.post_url_method.aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "create-short-url-a57940d"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:692735942459:ktqo0w8q1j/*/POST/"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.redirect_lambda.data.aws_iam_policy_document.policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "policies" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + minified_json             = (known after apply)
      + override_policy_documents = [
          + (known after apply),
        ]

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
          + sid       = "LogToCloudwatch"
        }
    }

  # module.redirect_lambda.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "redirect-a57940d-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "DefaultPolicy"
          + policy = (known after apply)
        }
    }

  # module.redirect_lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "redirect-a57940d_lambda_function_payload.zip"
      + function_name                  = "redirect-a57940d"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)
    }

  # module.redirect_url_method.aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "n44nx6"
      + rest_api_id             = "ktqo0w8q1j"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.redirect_url_method.aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "redirect-a57940d"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:692735942459:ktqo0w8q1j/*/GET/{redirectCode}"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_gateway_stage = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @EsmerlinJM, Action: `pull_request`*